const mediaFiles = {
  polatoka: "/polatoka.mp3",
  dhandharthekeo: "/dhandharthekeo.mp3",
  sanamcomposition: "/sanamcomposition.mp3",
  sanamVideo: "/sanam.mp4",
  rpVideo: "/rp.mp4",
  ekaekaVideo: "/sheyje_arijit_square.mp4",
  spotifyAndMural: "/spotifyandmural.mp4",
  cafe: "/cafe.mp4",
  swanSong: "/swanSong.mp4",
  nodeVideo: "/node.mp4",
  juttiVideo: "/jutti.mp4",
};

const images = {
  sanamImage: "/sanam.jpg",
  rpImage: "/rp.jpg",
  rpSketch: "/rpsketch.png",
  avatarImage: "/rimjhim.svg",
  pySanam: "/pysanam.png",
  pyRP: "/pyrp.png",
};

export { mediaFiles, images };

export const LYRICS = [
  "👀",
  "পলাতকা প্লাবনের পরী প্রণয়নী",
  "কিসের তালে নেচে উঠেছে ধমনী?",
  "পলাতকা প্লাবনের পরী প্রণয়নী",
  "কিসের তালে নেচে উঠেছে ধমনী?",
  "জানি বেঁকে গেছে নদী, তবুও তো নিরবধি",
  "মিছিলে-মিছিলে আমি খুঁজেছি তোমায়...",
  "কবিতায়, খালি পায়ে, সব খেলা ফেলে",
  "ছুটেছি খুব, দেব ডুব, আমি ডানা মেলে",
  "হায় কবিতায়, খালি পায়ে, সব খেলা ফেলে",
  "ছুটেছি খুব, দেব ডুব, আমি ডানা মেলে",
  "সবুজে-সাদাতে-লালে, কি সায়রে কি ডোবালে?",
  "শব্দের ডুবুরিরা চিনেছে তোমায়...",
  "অসহায়, মৃতপ্রায়, আহা কোনোমতে",
  "তুমি আলোকিত, সজ্জিত, ছায়াপথে",
  "হায়, অসহায়, মৃতপ্রায়, আহা কোনোমতে",
  "তুমি আলোকিত, সজ্জিত, ছায়াপথে",
  "গোপনে-গোপনে যতো শব্দেরা অবিরত",
  "তোমাকেই ডাকে, তুমি শোনোনা বোধহয়...",
];

export const INTRO_OG = [
  "প্রথম প্রেমে পড়ার পর সবাই পস্তায়",
  "হন্যে হয়ে ক্লাস পালিয়ে ঘুরেছি রাস্তায়",
  "প্রথম প্রেম ঘুচে যাওয়ার যন্ত্রণাকে নিয়ে",
  "কান্না চেপে ঘুরেছিলাম তোমারই পথ দিয়ে",
  "এই শহর জানে আমার প্রথম সবকিছু",
  "পালাতে চাই যত, সে আসে আমার পিছু পিছু",
];

export const INTRO = [
  "প্রথম কলেজ শেষে তোমায় দেখতে আসা",
  "গিটার নিয়ে গান ধরেছে আমার ভালোবাসা",
  "লজ্জা, ঘৃণা, রাগের পরে এটাও বুঝি থাকে?",
  "এটাই দেব তোমায়, আর এই শহর টাকে",
  "এই শহর জানে আমার প্রথম সবকিছু",
  "পালাতে চাই যত, সে আসে আমার পিছু পিছু",
];

export const MUSIC = {
  POLATOKA: mediaFiles.polatoka,
  DHANDHAR_THEKEO: mediaFiles.dhandharthekeo,
  SANAM: mediaFiles.sanamcomposition,
};

export const MEDIA = {
  SANAM_IMG: images.sanamImage,
  RP_IMG: images.rpImage,
  RP_SKETCH: images.rpSketch,
  PY_SANAM: images.pySanam,
  PY_RP: images.pyRP,
  AVATAR_IMG: images.avatarImage,
  SANAM_VIDEO: mediaFiles.sanamVideo,
  RP_VIDEO: mediaFiles.rpVideo,
  SHEY_JE_VIDEO: mediaFiles.ekaekaVideo,
  MURAL_VIDEO: mediaFiles.spotifyAndMural,
  CAFE_VIDEO: mediaFiles.cafe,
  SWANSONG_VIDEO: mediaFiles.swanSong,
  NODE_VIDEO: mediaFiles.nodeVideo,
  JUTTI_VIDEO: mediaFiles.juttiVideo,
};

export const GITHUB_URI = "https://github.com/sanam2405/rp";

export const DARK_SCREEN = 0.95;
export const LIGHT_SCREEN = 0.05;
export const CUSTOM_PROMPT = "\x1B[1;31mrimjhim@sanam\x1B[0m $ ";
