const mediaFiles = {
  polatoka: "/polatoka.mp3",
  dhandharthekeo: "/dhandharthekeo.mp3",
  sanamcomposition: "/sanamcomposition.mp3",
  sanamVideo: "/sanam.mp4",
  rpVideo: "/rp.mp4",
  ekaekaVideo: "/sheyje_arijit_square.mp4",
};

const images = {
  sanamImage: "/sanam.jpg",
  rpImage: "/rp.jpg",
  rpSketch: "/rpsketch.png",
  avatarImage: "/rimjhim.svg",
};

export { mediaFiles, images };

export const LYRICS = [
  "👀",
  "পলাতকা প্লাবনের পরী প্রণয়নী",
  "কিসের তালে নেচে উঠেছে ধমনী?",
  "পলাতকা প্লাবনের পরী প্রণয়নী",
  "কিসের তালে নেচে উঠেছে ধমনী?",
  "জানি বেঁকে গেছে নদী, তবুও তো নিরবধি",
  "মিছিলে-মিছিলে আমি খুঁজেছি তোমায়...",
  "কবিতায়, খালি পায়ে, সব খেলা ফেলে",
  "ছুটেছি খুব, দেব ডুব, আমি ডানা মেলে",
  "হায় কবিতায়, খালি পায়ে, সব খেলা ফেলে",
  "ছুটেছি খুব, দেব ডুব, আমি ডানা মেলে",
  "সবুজে-সাদাতে-লালে, কি সায়রে কি ডোবালে?",
  "শব্দের ডুবুরিরা চিনেছে তোমায়...",
  "অসহায়, মৃতপ্রায়, আহা কোনোমতে",
  "তুমি আলোকিত, সজ্জিত, ছায়াপথে",
  "হায়, অসহায়, মৃতপ্রায়, আহা কোনোমতে",
  "তুমি আলোকিত, সজ্জিত, ছায়াপথে",
  "গোপনে-গোপনে যতো শব্দেরা অবিরত",
  "তোমাকেই ডাকে, তুমি শোনোনা বোধহয়...",
];

export const MUSIC = {
  POLATOKA: mediaFiles.polatoka,
  DHANDHAR_THEKEO: mediaFiles.dhandharthekeo,
  SANAM: mediaFiles.sanamcomposition,
};

export const MEDIA = {
  SANAM_IMG: images.sanamImage,
  RP_IMG: images.rpImage,
  RP_SKETCH: images.rpSketch,
  SANAM_VIDEO: mediaFiles.sanamVideo,
  RP_VIDEO: mediaFiles.rpVideo,
  AVATAR_IMG: images.avatarImage,
  SHEY_JE_VIDEO: mediaFiles.ekaekaVideo,
};

export const GITHUB_URI = "https://github.com/sanam2405/rp";

export const DARK_SCREEN = 0.95;
export const LIGHT_SCREEN = 0.05;
